WingProp/Prop/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        //- Master side patch
        name            per1;
        patchInfo
        {
            type            cyclic;
            matchTolerance  0.0001;
            neighbourPatch  per2;
            transform       noOrdering;
        }
        constructFrom patches;
        patches (per1);
    }

    {
        //- Slave side patch
        name            per2;
        patchInfo
        {
            type            cyclic;
            matchTolerance  0.0001;
            neighbourPatch  per1;
            transform       noOrdering;
        }
        constructFrom patches;
        patches (per2);
    }

);

// ************************************************************************* //
